#include <stdio.h>
int main()
{
    int a, b, c;
    printf("Enter Number a : ");
    scanf("%d", &a);
    printf("Enter Number b : ");
    scanf("%d", &b);
    c = a + b;
    printf("%d + %d = %d", a, b, c);
    return 0;
}

/*================== Output ==================
Enter Number a : 3
Enter Number b : 4
3 + 4 = 7
*/

/*================== วิเคราะห์การทำงาน และอธิบายข้อบกพร่องของโปรแกรม ==================
    โปรแกรมนี้เป็นโปรแกรมพื้นฐาน ที่รับค่าจำนวนเต็มสองจำนวนจากผู้ใช้ และทำการบวกจำนวนทั้งสองเข้าด้วยกัน จากนั้นจะแสดงผลลัพธ์ของการบวกออกมา
ข้อบกพร่องที่อาจจะเกิดขึ้นคือ กรณีที่ผู็ใช้อาจจะไม่ได้ป้อนค่าที่เป็นจำนวนเต็ม หรือป้อนค่าที่ไม่ใช่ตัวเลข ทำให้เกิดข้อผิดพลาดในการทำงานของโปรแกรมได้
*/