#include <stdio.h>
int main()
{
    printf("%184.1s\n", "S");
    printf("\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nA");
    printf("มีความยาวทั้งหมด %d ตัวอักษร\n", 184);
    printf("มีความสูงทั้งหมด %d บรรทัด\n", 25);
    return 0;
}

// การหาความยาว: ใช้การเพิ่มค่าของพื้นที่ที่ได้จองไว้ของ %s ให้เพิ่มขึ้นเรื่อยๆ จนกว่าตัวอักษรที่แสดงจะขึ้นบรรทัดใหม่
// การหาความสูง:ใช้ ASGII Code คือ \n ในการเพิ่มบรรทัดไปเรื่อยๆจนกว่าจะเลยความสูงของหน้าต่างแสดงผล ณ ขณะนั้น
//[การตรวจสอบทั้งหมดนี้อยู่ถายใต้เงื่อนไขว่า หน้าต่างแสดงผลนั้นมีขนาดเท่าเดิมเสมอ ไม่ถูกยืด/ขยาย ]