/*
 * ==============================================================
 *  หัวข้อ    : Function
 *  ข้อที่    : 4    |    ระดับ : ปานกลาง
 *  ชื่อโจทย์ : ห.ร.ม. และ ค.ร.น.
 * ==============================================================
 *  [โจทย์]
 *    เขียนฟังก์ชัน  int gcd(int a, int b);  (วิธีของยุคลิด จะวนลูปหรือ recursive ก็ได้)
 *    และ  int lcm(int a, int b);  ซึ่งต้องเรียกใช้ gcd ภายใน
 *
 *  [Input]
 *    จำนวนเต็มบวก 2 จำนวน
 *
 *  [Output]
 *    GCD และ LCM
 *
 *  [Test case 1]
 *   Input:
 *      12 18
 *   Output:
 *      GCD = 6
 *      LCM = 36
 *
 *  [Test case 2]
 *   Input:
 *      7 5
 *   Output:
 *      GCD = 1
 *      LCM = 35
 *
 * ==============================================================
 */
#include <stdio.h>

int main(void)
{
    /* เขียนคำตอบของคุณที่นี่ */

    return 0;
}
