/*
 * ==============================================================
 *  หัวข้อ    : Function
 *  ข้อที่    : 6    |    ระดับ : ปานกลาง
 *  ชื่อโจทย์ : ผลรวมเลขโดดและกลับเลข
 * ==============================================================
 *  [โจทย์]
 *    เขียนฟังก์ชัน
 *      int sumDigits(int n);       // ผลรวมเลขโดด (ลองเขียนแบบ recursive)
 *      int reverseNumber(int n);   // กลับลำดับเลขโดด
 *
 *  [Input]
 *    จำนวนเต็ม n (0 <= n <= 999999999)
 *
 *  [Output]
 *    Sum และ Reverse
 *
 *  [Test case 1]
 *   Input:
 *      12345
 *   Output:
 *      Sum = 15
 *      Reverse = 54321
 *
 *  [Test case 2]
 *   Input:
 *      900
 *   Output:
 *      Sum = 9
 *      Reverse = 9
 *
 * ==============================================================
 */
#include <stdio.h>

int main(void)
{
    /* เขียนคำตอบของคุณที่นี่ */

    return 0;
}
